RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal.c
/** @defgroup HAL_Exported_Functions_Group3 HAL Debug functions
  *  @brief    HAL Debug functions
  *
@verbatim
 ===============================================================================
                      ##### HAL Debug functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable/Disable Debug module during SLEEP mode
      (+) Enable/Disable Debug module during STOP mode
      (+) Enable/Disable Debug module during STANDBY mode

@endverbatim
  * @{
  */

/**
  * @brief  Enable the Debug Module during SLEEP mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during SLEEP mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Enable the Debug Module during STOP mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during STOP mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Enable the Debug Module during STANDBY mode.
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Disable the Debug Module during STANDBY mode.
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group4 HAL SBS configuration functions
  *  @brief    HAL SBS configuration functions
  *
@verbatim
 ===============================================================================
                      ##### HAL SBS configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Increment/get the HDPL value
      (+) Configure the debug access
      (+) Configure timer break inputs
      (+) Enable/Disable the I/O analog switch voltage booster
      (+) Enable/Disable the I/O analog switch supplied by VDD
      (+) Configure/Enable/Disable the compensation cell (IO, XSPI1, XSPI2)

@endverbatim
  * @{
  */

/**
  * @brief  Get the boot address holding the initial vector table for Cortex-M7.
  * @retval Physical boot address used by the Cortex-M7 after reset
  */
uint32_t HAL_SBS_GetBootAddress(void)
{
  return SBS->BOOTSR;
}

/**
  * @brief  Increment hise protection level.
  * @retval None
  */
void HAL_SBS_IncrementHDPLValue(void)
{
  MODIFY_REG(SBS->HDPLCR, SBS_HDPLCR_INCR_HDPL, SBS_HDPL_INCREMENT_VALUE);
}

/**
  * @brief  Get the current value of the hide protection level.
  * @retval Current hide protection level
  *            This value is one of @ref SBS_HDPL_Value
  */
uint32_t HAL_SBS_GetHDPLValue(void)
{
  return (SBS->HDPLSR & SBS_HDPLSR_HDPL);
}

/**
  * @brief  Open the device access port.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_OpenAccessPort(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_AP_UNLOCK, SBS_DEBUG_UNLOCK_VALUE);
}

/**
  * @brief  Open the debug when the hide protection level is authorized.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_OpenDebug(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_UNLOCK, (SBS_DEBUG_UNLOCK_VALUE << SBS_DBGCR_DBG_UNLOCK_Pos));
}

/**
  * @brief  Configure the authenticated debug hide protection level.
  * @note   This function can be only used when device state is Closed.
  * @param  Level Hide protection level where the authenticated debug opens
  *            This value is one of @ref SBS_HDPL_Value (except SBS_HDPL_VALUE_0)
  * @retval HAL_OK if parameter is correct
  *         HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_SBS_ConfigDebugLevel(uint32_t Level)
{
  /* Check the parameter */
  assert_param(IS_SBS_HDPL(Level));

  if (Level != SBS_HDPL_VALUE_0)
  {
    MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_AUTH_HDPL, (Level << SBS_DBGCR_DBG_AUTH_HDPL_Pos));
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Get the current value of the hide protection level.
  * @note   This function can be only used when device state is Closed.
  * @retval Current hide protection level
  *            This value is one of @ref SBS_HDPL_Value
  */
uint32_t HAL_SBS_GetDebugLevel(void)
{
  return ((SBS->DBGCR & SBS_DBGCR_DBG_AUTH_HDPL) >> SBS_DBGCR_DBG_AUTH_HDPL_Pos);
}

/**
  * @brief  Unlock the access to the debug control register.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_UnlockDebugConfig(void)
{
  MODIFY_REG(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK, SBS_DEBUG_UNLOCK_VALUE);
}

/**
  * @brief  Lock the access to the debug control register.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_LockDebugConfig(void)
{
  MODIFY_REG(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK, SBS_DEBUG_LOCK_VALUE);
}

/**
  * @brief  Configure the command passed to the RSS for execution at next reset.
  * @param  Cmd Command passed to the RSS for execution at next reset
  *            This value is between 0 and 0xFFFF
  * @retval None
  */
void HAL_SBS_ConfigRSSCommand(uint32_t Cmd)
{
  MODIFY_REG(SBS->RSSCMDR, SBS_RSSCMDR_RSSCMD, Cmd);
}

/**
  * @brief  Get the command passed to the RSS for execution at next reset.
  * @retval Command passed to the RSS for execution at next reset
  */
uint32_t HAL_SBS_GetRSSCommand(void)
{
  return (SBS->RSSCMDR & SBS_RSSCMDR_RSSCMD);
}

/**
  * @brief  Enable the I/O analog switch voltage booster
  * @note   Insure low VDDA voltage operation with I/O analog switch control
  * @retval None
  */
void HAL_SBS_EnableIOAnalogBooster(void)
{
  MODIFY_REG(SBS->PMCR, (SBS_PMCR_BOOSTEN | SBS_PMCR_BOOSTVDDSEL), SBS_PMCR_BOOSTEN);
}

/**
  * @brief  Disable the I/O analog switch voltage booster
  * @retval None
  */
void HAL_SBS_DisableIOAnalogBooster(void)
{
  CLEAR_BIT(SBS->PMCR, SBS_PMCR_BOOSTEN);
}

/**
  * @brief  Enable the I/O analog switch supplied by VDD
  * @note   To be used when I/O analog switch voltage booster is not enabled
  * @retval None
  */
void HAL_SBS_EnableIOAnalogSwitchVdd(void)
{
  MODIFY_REG(SBS->PMCR, (SBS_PMCR_BOOSTEN | SBS_PMCR_BOOSTVDDSEL), SBS_PMCR_BOOSTVDDSEL);
}

/**
  * @brief  Disable the I/O analog switch supplied by VDD
  * @retval None
  */
void HAL_SBS_DisableIOAnalogSwitchVdd(void)
{
  CLEAR_BIT(SBS->PMCR, SBS_PMCR_BOOSTVDDSEL);
}

/**
  * @brief  Configure the Ethernet PHY interface
  * @param  Config  specifies the Ethernet PHY interface
  *         This parameter can be one of the following values:
  *            @arg SBS_ETHERNET_PHY_GMII_OR_MII GMMI or MII selection
  *            @arg SBS_ETHERNET_PHY_RMII RMII selection
  * @retval None
  */
void HAL_SBS_ConfigEthernetPHY(uint32_t Config)
{
  /* Check the parameter */
  assert_param(IS_SBS_ETHERNET_PHY(Config));

