RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal.c
  MODIFY_REG(SBS->PMCR, SBS_PMCR_ETH_PHYSEL, Config);
}

/**
  * @brief  Configure the ECC AXISRAMs wait state when ECC=0
  * @param  Config  specifies the number of wait state
  *         This parameter can be one of the following values:
  *            @arg SBS_AXISRAM_WS_0 0 wait state selection
  *            @arg SBS_AXISRAM_WS_1 1 wait state selection
  * @retval None
  */
void HAL_SBS_ConfigAXISRAMWaitState(uint32_t Config)
{
  /* Check the parameter */
  assert_param(IS_SBS_AXISRAM_WS(Config));

  MODIFY_REG(SBS->PMCR, SBS_PMCR_AXISRAM_WS, Config);
}

/**
  * @brief  Enable the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can the combination of the following values:
  *            @arg SBS_IO_ANALOG_CELL Compensation cell for the I/O analog switches
  *            @arg SBS_IO_XSPI1_CELL Compensation cell for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_CELL Compensation cell for the I/O of the XSPI2
  * @retval None
  */
void HAL_SBS_EnableCompensationCell(uint32_t Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_COMPENSATION_CELL(Selection));

  SET_BIT(SBS->CCCSR, Selection);
}

/**
  * @brief  Disable the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can the combination of the following values:
  *            @arg SBS_IO_ANALOG_CELL Compensation cell for the I/O analog switches
  *            @arg SBS_IO_XSPI1_CELL Compensation cell for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_CELL Compensation cell for the I/O of the XSPI2
  * @retval None
  */
void HAL_SBS_DisableCompensationCell(uint32_t Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_COMPENSATION_CELL(Selection));

  MODIFY_REG(SBS->CCCSR, Selection, 0U);
}

/**
  * @brief  Get the compensation cell ready status
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SBS_IO_ANALOG_CELL_READY Compensation cell for the I/O analog switches
  *            @arg SBS_IO_XSPI1_CELL_READY Compensation cell for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_CELL_READY Compensation cell for the I/O of the XSPI2
  * @retval Ready status (1 or 0)
  */
uint32_t HAL_SBS_GetCompensationCellReadyStatus(uint32_t Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_COMPENSATION_CELL_READY(Selection));

  return (((SBS->CCCSR & Selection) == 0U) ? 0UL : 1UL);
}

/**
  * @brief  Configure the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SBS_IO_ANALOG_CELL Compensation cell for the I/O analog switches
  *            @arg SBS_IO_XSPI1_CELL Compensation cell for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_CELL Compensation cell for the I/O of the XSPI2
  * @param  Code code selection to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *            @arg SBS_IO_CELL_CODE  Code from the cell (available in the SBS_CCVALR)
  *            @arg SBS_IO_REGISTER_CODE Code from the compensation cell code register (SBS_CCSWVALR)
  * @param  NmosValue In case SBS_IO_REGISTER_CODE is selected, it  provides the Nmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @param  PmosValue In case SBS_IO_REGISTER_CODE is selected, it  provides the Pmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @retval None
  */
void HAL_SBS_ConfigCompensationCell(uint32_t Selection, uint32_t Code, uint32_t NmosValue, uint32_t PmosValue)
{
  uint32_t offset;

  /* Check the parameters */
  assert_param(IS_SBS_COMPENSATION_CELL(Selection));
  assert_param(IS_SBS_IO_COMPENSATION_CODE(Code));

  if (Code == SBS_IO_REGISTER_CODE)
  {
    /* Check the parameters */
    assert_param(IS_SBS_IO_COMPENSATION_CELL_NMOS_VALUE(NmosValue));
    assert_param(IS_SBS_IO_COMPENSATION_CELL_PMOS_VALUE(PmosValue));

    offset = ((Selection == SBS_IO_ANALOG_CELL) ? 0U : ((Selection == SBS_IO_XSPI1_CELL) ? 8U : 16U));

    MODIFY_REG(SBS->CCSWVALR, (0xFFU << offset), ((NmosValue << offset) | (PmosValue << (offset + 4U))));
  }

  MODIFY_REG(SBS->CCCSR, (Selection << 1U), (Code << (POSITION_VAL(Selection) + 1U)));
}

/**
  * @brief  Get the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SBS_IO_ANALOG_CELL Compensation cell for the I/O analog switches
  *            @arg SBS_IO_XSPI1_CELL Compensation cell for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_CELL Compensation cell for the I/O of the XSPI2
  * @param  pCode pointer code selection
  *         This parameter can be one of the following values:
  *            @arg SBS_IO_CELL_CODE  Code from the cell (available in the SBS_CCVALR)
  *            @arg SBS_IO_REGISTER_CODE Code from the compensation cell code register (SBS_CCSWVALR)
  * @param  pNmosValue pointer to the Nmos value in range 0 to 15
  * @param  pPmosValue pointer to the Pmos value in range 0 to 15
  * @retval  HAL_OK (all values available) or HAL_ERROR (check parameters)
  */
HAL_StatusTypeDef HAL_SBS_GetCompensationCell(uint32_t Selection, uint32_t *pCode, uint32_t *pNmosValue,
                                              uint32_t *pPmosValue)
{
  uint32_t reg;
  uint32_t offset;
  HAL_StatusTypeDef status = HAL_ERROR;

  /* Check parameters */
  if ((pCode != NULL) && (pNmosValue != NULL) && (pPmosValue != NULL))
  {
    *pCode = ((SBS->CCCSR & (Selection << 1U)) == 0U) ? SBS_IO_CELL_CODE : SBS_IO_REGISTER_CODE;

    reg = (*pCode == SBS_IO_CELL_CODE) ? (SBS->CCVALR) : (SBS->CCSWVALR);
    offset = ((Selection == SBS_IO_ANALOG_CELL) ? 0U : ((Selection == SBS_IO_XSPI1_CELL) ? 8U : 16U));

