RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal.c
    *pNmosValue = ((reg >> offset) & 0xFU);
    *pPmosValue = ((reg >> (offset + 4U)) & 0xFU);

    status = HAL_OK;
  }
  return status;
}

/**
  * @brief  Enable the high speed at low voltage
  * @param  Selection specifies the concerned IOs
  *         This parameter can the combination of the following values:
  *            @arg SBS_IO_ANALOG_HSLV High speed at low voltage for the I/O analog switches
  *            @arg SBS_IO_XSPI1_HSLV High speed at low voltage for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_HSLV High speed at low voltage for the I/O of the XSPI2
  * @retval None
  */
void HAL_SBS_EnableIOSpeedOptimize(uint32_t Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_IOHSLV(Selection));

  SET_BIT(SBS->CCCSR, Selection);
}

/**
  * @brief  Disable the high speed at low voltage
  * @param  Selection specifies the concerned IOs
  *         This parameter can the combination of the following values:
  *            @arg SBS_IO_ANALOG_HSLV High speed at low voltage for the I/O analog switches
  *            @arg SBS_IO_XSPI1_HSLV High speed at low voltage for the I/O of the XSPI1
  *            @arg SBS_IO_XSPI2_HSLV High speed at low voltage for the I/O of the XSPI2
  * @retval None
  */
void HAL_SBS_DisableIOSpeedOptimize(uint32_t Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_IOHSLV(Selection));

  MODIFY_REG(SBS->CCCSR, Selection, 0U);
}

/**
  * @brief  Configure the Timer Break input for error flag(s).
  * @note   When a configuration is set, only a system reset can reset it.
  * @param  Input input configuration
  *              This parameter can be one or a combinartion of the following values:
  *                @arg SBS_TIMER_BREAK_LOCK_PVD      PVD flag
  *                @arg SBS_TIMER_BREAK_LOCK_FLASH    FLASH double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_CORE     M7 LOCKUP (Hardfault) output
  *                @arg SBS_TIMER_BREAK_LOCK_ITCM     ITCM double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_DTCM     DTCM double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_AXISRAM1 AXISRAM1 double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_AXISRAM3 AXISRAM3 double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_BKPRAM   Backup SRAM double ECC error flag
  * @retval None
  */
void HAL_SBS_ConfigTimerBreakInput(uint32_t Input)
{
  /* Check the parameter */
  assert_param(IS_SBS_TIMER_BREAK_INPUT(Input));

  SET_BIT(SBS->BKLOCKR, Input);
}

/**
  * @brief  Get the Timer Break input configuration.
  * @note   When a configuration is set, only a system reset can reset it.
  * @retval Timer break input configuration
  *              This return value can be one or a combinartion of the following values:
  *                @arg SBS_TIMER_BREAK_LOCK_PVD      PVD flag
  *                @arg SBS_TIMER_BREAK_LOCK_FLASH    FLASH double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_CORE     M7 LOCKUP (Hardfault) output
  *                @arg SBS_TIMER_BREAK_LOCK_ITCM     ITCM double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_DTCM     DTCM double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_AXISRAM1 AXISRAM1 double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_AXISRAM3 AXISRAM3 double ECC error flag
  *                @arg SBS_TIMER_BREAK_LOCK_BKPRAM   Backup SRAM double ECC error flag
  */
uint32_t HAL_SBS_GetTimerBreakInputConfig(void)
{
  return (SBS->BKLOCKR & SBS_BKLOCKR_MASK);
}

/**
  * @brief  Configure the source input used for EXTI.
  * @param  Exti EXTI event to be configured
  *              This parameter should be between 0 and 15
  * @param  Port Port whom pin is used
  *              This parameter can be one of the following values:
  *                @arg SBS_EXTI_PIN_PORTA Port A pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTB Port B pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTC Port C pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTD Port D pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTE Port E pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTF Port F pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTG Port G pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTH Port H pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTM Port M pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTN Port N pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTO Port O pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTP Port P pin input of EXTI event detection
  * @retval None
  */
void HAL_SBS_EXTIConfig(uint32_t Exti, uint32_t Port)
{
  uint32_t reg;
  uint32_t offset;

  /* Check the parameters */
  assert_param(IS_SBS_EXTI_INPUT(Exti));
  assert_param(IS_SBS_EXTI_PIN(Port));

  reg = (Exti / 4U);
  offset = (4U * (Exti % 4U));

  MODIFY_REG(SBS->EXTICR[reg], (0xFU << offset), (Port << offset));
}

/**
  * @brief  Get the source input used for EXTI.
  * @param  Exti EXTI configuration requested
  *              This parameter should be between 0 and 15
  * @retval Return value is port whom pin is used
  *              This return value can be one of the following values:
  *                @arg SBS_EXTI_PIN_PORTA Port A pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTB Port B pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTC Port C pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTD Port D pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTE Port E pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTF Port F pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTG Port G pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTH Port H pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTM Port M pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTN Port N pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTO Port O pin input of EXTI event detection
  *                @arg SBS_EXTI_PIN_PORTP Port P pin input of EXTI event detection
  */
uint32_t HAL_SBS_GetEXTIConfig(uint32_t Exti)
{
  uint32_t reg;
  uint32_t offset;

  /* Check the parameters */
  assert_param(IS_SBS_EXTI_INPUT(Exti));

  reg = (Exti / 4U);
  offset = (4U * (Exti % 4U));

  return ((SBS->EXTICR[reg] & (0xFUL << offset)) >> offset);
}
/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group5 VREFBUF Control functions
  *  @brief    HAL Control functions
  *
@verbatim
 ===============================================================================
                      ##### HAL Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure the internal voltage reference buffer voltage scale
      (+) Configure the internal voltage reference buffer high impedance mode
      (+) Tune the Internal Voltage Reference buffer
      (+) Enable the Internal Voltage Reference buffer
      (+) Disable the Internal Voltage Reference buffer

@endverbatim
  * @{
  */

/**
  * @brief Configure the internal voltage reference buffer voltage scale.
  * @param VoltageScaling  specifies the output voltage to achieve
  *          This parameter can be one of the following values:
  *            @arg VREFBUF_VOLTAGE_SCALE0: VREF_OUT1 around 2.5 V.
  *                                                This requires VDDA equal to or higher than 2.8 V.
  *            @arg VREFBUF_VOLTAGE_SCALE1: VREF_OUT2 around 2.048 V.
  *                                                This requires VDDA equal to or higher than 2.4 V.
  *            @arg VREFBUF_VOLTAGE_SCALE2: VREF_OUT3 around 1.8 V.
  *                                                This requires VDDA equal to or higher than 2.1 V.
  *            @arg VREFBUF_VOLTAGE_SCALE3: VREF_OUT4 around 1.5 V.
  *                                                This requires VDDA equal to or higher than 1.8 V.
  * @retval None
  */
void HAL_VREFBUF_VoltageScalingConfig(uint32_t VoltageScaling)
{
  /* Check the parameters */
  assert_param(IS_VREFBUF_VOLTAGE_SCALE(VoltageScaling));

  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_VRS, VoltageScaling);
}

/**
  * @brief Configure the internal voltage reference buffer high impedance mode.
  * @param Mode  specifies the high impedance mode
  *          This parameter can be one of the following values:
  *            @arg VREFBUF_HIGH_IMPEDANCE_DISABLE: VREF+ pin is internally connect to VREFINT output.
  *            @arg VREFBUF_HIGH_IMPEDANCE_ENABLE: VREF+ pin is high impedance.
  * @retval None
  */
void HAL_VREFBUF_HighImpedanceConfig(uint32_t Mode)
{
  /* Check the parameters */
  assert_param(IS_VREFBUF_HIGH_IMPEDANCE(Mode));

  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_HIZ, Mode);
}

/**
  * @brief  Tune the Internal Voltage Reference buffer (VREFBUF).
  * @retval None
  */
void HAL_VREFBUF_TrimmingConfig(uint32_t TrimmingValue)
{
  /* Check the parameters */
  assert_param(IS_VREFBUF_TRIMMING(TrimmingValue));

