RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal.c
  MODIFY_REG(VREFBUF->CCR, VREFBUF_CCR_TRIM, TrimmingValue);
}

/**
  * @brief  Enable the Internal Voltage Reference buffer (VREFBUF).
  * @retval HAL_OK/HAL_TIMEOUT
  */
HAL_StatusTypeDef HAL_VREFBUF_Enable(void)
{
  uint32_t  tickstart;

  SET_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait for VRR bit  */
  while (READ_BIT(VREFBUF->CSR, VREFBUF_CSR_VRR) == 0UL)
  {
    if ((HAL_GetTick() - tickstart) > VREFBUF_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Disable the Internal Voltage Reference buffer (VREFBUF).
  *
  * @retval None
  */
void HAL_VREFBUF_Disable(void)
{
  CLEAR_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);
}
/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group6 HAL AXIM configuration functions
  *  @brief    HAL AXI Interconnect Matrix (AXIM) configuration functions
  *
@verbatim
 ===============================================================================
                      ##### HAL AXIM configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configures ASIB (AMBA slave interface blocks) and AMIB (AMBA master interface blocks) parameters,
          such as the QoS (quality of service) level.
@endverbatim
  * @{
  */

/**
  * @brief Enable packing for ASIB.
  * @note  Normal operation, Enable packing of beats to match the output data width.
  * @param AsibInstance  specifies the ASIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_1 : ASIB 1 connected to AHB master
  *            @arg AXIM_ASIB_2 : ASIB 2 connected to SDMMC1 master
  * @retval None
  */
void HAL_AXIM_ASIB_EnablePacking(AXIM_ASIB_TypeDef *AsibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_ASIB_ALL_INSTANCE(AsibInstance));

  /* Apply packing configuration for the selected ASIB */
  WRITE_REG(AsibInstance->FNMOD2, 0U);
}

/**
  * @brief Disable packing for ASIB.
  * @note  Network does not perform any packing of beats to match the output data width.
  * @note  Unaligned transactions are not realigned to the input data word boundary.
  * @param AsibInstance  specifies the ASIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_1 : ASIB 1 connected to AHB master
  *            @arg AXIM_ASIB_2 : ASIB 2 connected to SDMMC1 master
  * @retval None
  */
void HAL_AXIM_ASIB_DisablePacking(AXIM_ASIB_TypeDef *AsibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_ASIB_ALL_INSTANCE(AsibInstance));

  /* Apply packing configuration for the selected ASIB */
  WRITE_REG(AsibInstance->FNMOD2, AXIM_ASIB_FNMOD2_BYPASS_MERGE);
}

/**
  * @brief Configure ASIB read/write issuing capability.
  * @param AsibInstance  specifies the ASIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_1  : ASIB 1 connected to AHB master
  *            @arg AXIM_ASIB_2  : ASIB 2 connected to SDMMC1 master
  *            @arg AXIM_ASIB_3  : ASIB 3 connected to HPDMA master
  *            @arg AXIM_ASIB_4  : ASIB 4 connected to C-M7 master
  *            @arg AXIM_ASIB_5  : ASIB 5 connected to GPU master
  *            @arg AXIM_ASIB_6  : ASIB 6 connected to GPU master
  *            @arg AXIM_ASIB_7  : ASIB 7 connected to GPU master
  *            @arg AXIM_ASIB_8  : ASIB 8 connected to DCMIPP master
  *            @arg AXIM_ASIB_9  : ASIB 9 connected to GFXMMU master
  *            @arg AXIM_ASIB_10 : ASIB 10 connected to LTDC master
  *            @arg AXIM_ASIB_11 : ASIB 11 connected to DMA2D master
  * @param ReadIssuing  specifies the Read issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_READ_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_ASIB_READ_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @param WriteIssuing  specifies the write issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_WRITE_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_ASIB_WRITE_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @retval None
  */
void HAL_AXIM_ASIB_IssuingConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t ReadIssuing, uint32_t WriteIssuing)
{
  /* Check the parameters */
  assert_param(IS_AXIM_ASIB_ALL_INSTANCE(AsibInstance));
  assert_param(IS_AXIM_ASIB_READ_ISS(ReadIssuing));
  assert_param(IS_AXIM_ASIB_WRITE_ISS(WriteIssuing));

  /* Apply read/write issuing configuration for the selected ASIB */
  WRITE_REG(AsibInstance->FNMOD, (ReadIssuing | WriteIssuing));
}

/**
  * @brief Configure ASIB read QOS priority.
  * @param AsibInstance  specifies the ASIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_1  : ASIB 1 connected to AHB master
  *            @arg AXIM_ASIB_2  : ASIB 2 connected to SDMMC1 master
  *            @arg AXIM_ASIB_3  : ASIB 3 connected to HPDMA master
  *            @arg AXIM_ASIB_4  : ASIB 4 connected to C-M7 master
  *            @arg AXIM_ASIB_5  : ASIB 5 connected to GPU master
  *            @arg AXIM_ASIB_6  : ASIB 6 connected to GPU master
  *            @arg AXIM_ASIB_7  : ASIB 7 connected to GPU master
  *            @arg AXIM_ASIB_8  : ASIB 8 connected to DCMIPP master
  *            @arg AXIM_ASIB_9  : ASIB 9 connected to GFXMMU master
  *            @arg AXIM_ASIB_10 : ASIB 10 connected to LTDC master
  *            @arg AXIM_ASIB_11 : ASIB 11 connected to DMA2D master
  * @param QosPriority  specifies read channel QoS setting
  *          This parameter can be a value between 0 to 15.
  *            With 0 value (default value) for the lowest priority and 15 value for Highest priority.
  * @retval None
  */
void HAL_AXIM_ASIB_ReadQoSConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t QosPriority)
{
  /* Check the parameters */
  assert_param(IS_AXIM_ASIB_ALL_INSTANCE(AsibInstance));
  assert_param(IS_AXIM_QOS(QosPriority));

  /* Apply read QOS priority setting for the selected ASIB */
  WRITE_REG(AsibInstance->READQOS, QosPriority);
}

/**
  * @brief Configure ASIB write QOS priority.
  * @param AsibInstance  specifies the ASIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_ASIB_1  : ASIB 1 connected to AHB master
  *            @arg AXIM_ASIB_2  : ASIB 2 connected to SDMMC1 master
  *            @arg AXIM_ASIB_3  : ASIB 3 connected to HPDMA master
  *            @arg AXIM_ASIB_4  : ASIB 4 connected to C-M7 master
  *            @arg AXIM_ASIB_5  : ASIB 5 connected to GPU master
  *            @arg AXIM_ASIB_6  : ASIB 6 connected to GPU master
  *            @arg AXIM_ASIB_7  : ASIB 7 connected to GPU master
  *            @arg AXIM_ASIB_8  : ASIB 8 connected to DCMIPP master
  *            @arg AXIM_ASIB_9  : ASIB 9 connected to GFXMMU master
  *            @arg AXIM_ASIB_10 : ASIB 10 connected to LTDC master
  *            @arg AXIM_ASIB_11 : ASIB 11 connected to DMA2D master
  * @param QosPriority  specifies write channel QoS setting
  *          This parameter can be a value between 0 to 15.
  *          With 0 value (default value) for the lowest priority and 15 value for highest priority.
  *
  * @retval None
  */
void HAL_AXIM_ASIB_WriteQoSConfig(AXIM_ASIB_TypeDef *AsibInstance, uint32_t QosPriority)
{
  /* Check the parameters */
  assert_param(IS_AXIM_ASIB_ALL_INSTANCE(AsibInstance));
  assert_param(IS_AXIM_QOS(QosPriority));

  /* Apply write QOS priority setting for the selected ASIB */
  WRITE_REG(AsibInstance->WRITEQOS, QosPriority);
}

/**
  * @brief Enable Packing for AMIB.
  * @note  Normal operation, Enable packing of beats to match the output data width.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_2 : AMIB 2 connected to AHB Sram slave
  * @retval None
  */
void HAL_AXIM_AMIB_EnablePacking(AXIM_AMIB_TypeDef *AmibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));

  /* Apply packing configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMOD2, 0U);
}

/**
  * @brief Disable Packing for AMIB.
  * @note  Network does not perform any packing of beats to match the output data width.
  * @note  Unaligned transactions are not realigned to the input data word boundary.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_2 : AMIB 2 connected to AHB Sram slave
  * @retval None
  */
void HAL_AXIM_AMIB_DisablePacking(AXIM_AMIB_TypeDef *AmibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));

  /* Apply packing configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMOD2, AXIM_AMIB_FNMOD2_BYPASS_MERGE);
}

/**
  * @brief Configure AMIB read/write issuing capability.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_1  : AMIB 1 connected to GFXMMU slave
  *            @arg AXIM_AMIB_2  : AMIB 2 connected to AHB Sram slave
  *            @arg AXIM_AMIB_3  : AMIB 3 connected to FMC slave
  *            @arg AXIM_AMIB_4  : AMIB 4 connected to XSPI1 slave
  *            @arg AXIM_AMIB_5  : AMIB 5 connected to XSPI2 slave
  *            @arg AXIM_AMIB_6  : AMIB 6 connected to AXI SRAM4 slave
  *            @arg AXIM_AMIB_7  : AMIB 7 connected to AXI SRAM3 slave
  *            @arg AXIM_AMIB_8  : AMIB 8 connected to AXI SRAM2 slave
  *            @arg AXIM_AMIB_9  : AMIB 9 connected to AXI SRAM1 slave
  *            @arg AXIM_AMIB_10 : AMIB 10 connected to FLASH slave
  * @param ReadIssuing  specifies the Read issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_READ_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_AMIB_READ_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @param WriteIssuing  specifies the write issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_WRITE_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_AMIB_WRITE_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @retval None
  */
void HAL_AXIM_AMIB_IssuingConfig(AXIM_AMIB_TypeDef *AmibInstance, uint32_t ReadIssuing, uint32_t WriteIssuing)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));
  assert_param(IS_AXIM_AMIB_READ_ISS(ReadIssuing));
  assert_param(IS_AXIM_AMIB_WRITE_ISS(WriteIssuing));

  /* Apply read/write issuing configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMOD, (ReadIssuing | WriteIssuing));
}

/**
  * @brief Configure AMIB read/write issuing bus matrix capability.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_1  : AMIB 1 connected to GFXMMU slave
  *            @arg AXIM_AMIB_2  : AMIB 2 connected to AHB Sram slave
  *            @arg AXIM_AMIB_3  : AMIB 3 connected to FMC slave
  *            @arg AXIM_AMIB_4  : AMIB 4 connected to XSPI1 slave
  *            @arg AXIM_AMIB_5  : AMIB 5 connected to XSPI2 slave
  *            @arg AXIM_AMIB_6  : AMIB 6 connected to AXI SRAM4 slave
  *            @arg AXIM_AMIB_7  : AMIB 7 connected to AXI SRAM3 slave
  *            @arg AXIM_AMIB_8  : AMIB 8 connected to AXI SRAM2 slave
  *            @arg AXIM_AMIB_9  : AMIB 9 connected to AXI SRAM1 slave
  *            @arg AXIM_AMIB_10 : AMIB 10 connected to FLASH slave
  * @param ReadIssuing  specifies the Read issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_READ_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_AMIB_READ_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @param WriteIssuing  specifies the write issuing capability to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_WRITE_ISS_NORMAL    : Normal issuing capability, default value.
  *            @arg AXIM_AMIB_WRITE_ISS_FORCE_TO_1: Force issuing capability to 1.
  * @retval None
  */
void HAL_AXIM_AMIB_IssuingConfigBusMatrix(AXIM_AMIB_TypeDef *AmibInstance, uint32_t ReadIssuing, uint32_t WriteIssuing)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));
  assert_param(IS_AXIM_AMIB_READ_ISS_BM(ReadIssuing));
  assert_param(IS_AXIM_AMIB_WRITE_ISS_BM(WriteIssuing));

  /* Apply read/write issuing configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMODBMISS, (ReadIssuing | WriteIssuing));
}

/**
  * @brief Enable Long burst for AMIB.
  * @note  Long bursts can be generated at the output of the AMIB.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_2 : AMIB 2 connected to AHB Sram slave
  * @retval None
  */
void HAL_AXIM_AMIB_EnableLongBurst(AXIM_AMIB_TypeDef *AmibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));

  /* Apply Long burst configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMODLB, AXIM_AMIB_FNMODLB_LONG_BURST);
}

/**
  * @brief Disable Long burst for AMIB.
  * @note  Long bursts can not be generated at the output of the AMIB.
  * @param AmibInstance  specifies the AMIB to configure
  *          This parameter can be one of the following values:
  *            @arg AXIM_AMIB_2 : AMIB 2 connected to AHB Sram slave
  * @retval None
  */
void HAL_AXIM_AMIB_DisableLongBurst(AXIM_AMIB_TypeDef *AmibInstance)
{
  /* Check the parameters */
  assert_param(IS_AXIM_AMIB_ALL_INSTANCE(AmibInstance));

  /* Apply Long burst configuration for the selected AMIB */
  WRITE_REG(AmibInstance->FNMODLB, 0U);
}
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
